{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "trainable": true, "batch_input_shape": [null, 3, 64, 64], "input_dtype": "float32", "nb_filter": 32, "nb_row": 3, "nb_col": 3, "init": "orthogonal", "activation": "relu", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "trainable": true, "nb_filter": 32, "nb_row": 3, "nb_col": 3, "init": "orthogonal", "activation": "relu", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "trainable": true, "nb_filter": 16, "nb_row": 3, "nb_col": 3, "init": "orthogonal", "activation": "relu", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "trainable": true, "nb_filter": 16, "nb_row": 3, "nb_col": 3, "init": "orthogonal", "activation": "relu", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "trainable": true, "nb_filter": 8, "nb_row": 3, "nb_col": 3, "init": "orthogonal", "activation": "relu", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_6", "trainable": true, "nb_filter": 8, "nb_row": 3, "nb_col": 3, "init": "orthogonal", "activation": "relu", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "output_dim": 128, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 2048}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_1", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "output_dim": 11, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 128}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "keras_version": "1.2.0"}